[
  {
    "title": "About Us",
    "content": "The UNCC Rugby club began as a small group of passionate rugby players on the campus of the University of North Carolina at Charlotte. In the early years, the club faced many challenges, including a lack of resources and limited opportunities to compete against other universities. However, the club persevered and continued to grow, driven by a shared love for the sport and a deep commitment to building a strong rugby community on campus. Over time, the UNCC Rugby club has become a fixture of the university's athletic scene, attracting new players and fans alike. Through hard work and dedication, the club has achieved significant success, earning recognition in regional and national rugby competitions. But beyond the accolades, the true spirit of the UNCC Rugby club lies in its inclusive and welcoming culture, where players of all backgrounds and skill levels come together to share their passion for the game. Today, the UNCC Rugby club continues to thrive, powered by a dedicated group of players, coaches, and supporters. As they look towards the future, the club remains committed to growing the sport of rugby in their community and providing a platform for players to develop their skills, build relationships, and create lifelong memories."
  },
  {
    "title": "Our Values",
    "content": "At the UNCC Rugby club, we prioritize our values as much as our performance on the field. We believe in teamwork, respect, excellence, and community service. Teamwork means supporting each other on and off the field, while respect means treating everyone with dignity and promoting diversity and inclusion. Excellence means setting high standards for ourselves and striving for continuous improvement. Community service means using rugby to make a positive impact in the world around us. These values define us as a club and guide us towards success, both on and off the field."
  },
  {
    "title": "Community Outreach",
    "content": "At the UNCC Rugby Club, we are committed to making a positive impact on our community. Through volunteer work, charity events, and partnerships with local organizations, we strive to improve the lives of those around us. We also promote the values of rugby, including teamwork, respect, and inclusivity, as a way to benefit individuals and communities. Our community outreach efforts aim to build a stronger, more connected community both on and off the rugby field."
  }
]
